print "Введите значения сторон треугольника: "
a = gets.chomp().to_i

b = gets.chomp().to_i

c= gets.chomp().to_i

#------------------------

if (a == b) & (a == c) & (b == c)   
  puts "Треугольник равносторонний"
else (a == b) || (a==c)|| (b == c) 
  puts "Треугольник равнобедренный"
end

#------------------------

if (a**2) == (b**2 + c**2)
  puts "Треугольник прямоугольный"
elsif (b**2) == (a**2 + c**2)
  puts "Треугольник прямоугольный"
end

if (c**2) == (b**2 + a**2)
  puts "Треугольник прямоугольный"
end

